package lec6;

public class SolidPrincips {
// 1. Single responsibility principle	
// Принцип единственной ответственности
// У класса есть предназначение

// 2. Open-closed principle
// Принцип открытости/закрытости
// Можно улучшать, но нельзя изменять

// 3. Liskov substitution principle
// Принцип подстановки Лисков
// Наследник не должен "ломать" поведение
// Наследник не должен делать меньше чем родитель

// 4. Interface segregation principle
// Принцип разделения интерфейса 
// Модули высокого уровня не должны зависеть от модулей нижнего уровня.
// И те, и другие должны зависеть от абстракций.
// Абстракции не должны зависеть от деталей. Детали должны зависеть от абстракций.
}
